
[
  {
    "type": "paragraphArray",
    "content": [
      "You're a Lebanese citizen, you shop online very often and one day you wonder. Why don't I start my own Online business?",
      "Regardless of whether you have started or not, there are things to consider, things to expect and things to be wary of.",
      "In this article, you will be learning all about ecommerce businesses in Lebanon."
    ]
  },
  {
    "type": "sectionTitle",
    "content": "Online shops in Lebanon are very different from other countries"
  },
  {
    "type": "paragraphArray",
    "content": [
      "Following tutorials on YouTube, created by people based in the USA and similar countries is the number one mistake people make.",
      "Lebanon on by itself is very different, its people are different. And so is their behavior towards online businesses and how they interact with them.",
      "Marketing strategies that excel in the UK might harm your business here in Lebanon. People and cultures are different, so should your business processes.",
      "It's not just psychological power, it is more about the spending power of individuals and the way they handle finances.",
      "Lebanese people are extremely economical."
    ]
  },
  {
    "type": "image",
    "src": "https://shoponlina.com/wp-content/uploads/2022/07/shopping-Lebanon.png"
  },
  {
    "type": "sectionTitle",
    "content": "Lack of technical knowledge amongst many consumers"
  },
  {
    "type": "paragraphArray",
    "content": [
      "While we are not traditional people that reject modern technology nor hate it, but there is a considerable amount of people that do NOT know how to use websites or advanced tools.",
      "It obviously depends on your target audience but do not be fooled to think everyone knows how to make orders via a website no matter how simple it is.",
      "A simple solution to this issue is, providing a clear, concise way for them to contact you. Specifically, Whatsapp.",
      "Doesn't mean less techy people are not going to buy from you, it just means you'll need to be ready to train & educate your customers on how to use your services and provide the most optimal user experience without headache, or god forbid, getting your customers confused. That is an instant loss.",
      "Do not overcomplicate your social media, and most importantly your website."
    ]
  },
  {
    "type": "sectionTitle",
    "content": "People do not read"
  },
  {
    "type": "image",
    "src": "https://lh3.googleusercontent.com/p/AF1QipP-a8m_M1n-Zch3KDFcGLg7TevIzhST8vyRvCtV=w1080-h608-p-no-v0"
  },
  {
    "type": "paragraphArray",
    "content": [
      "Starting your online shop is fun, crafting your product titles, descriptions and making them dense is fun. However, keep in mind people do not read, at all.",
      "While it might seem reasonable to share and brag about your product's benefits and why it is the most magnificent product they'll buy, it is wasted words.",
      "Doesn't mean do not list and mention important factors, just keep it short, keep it simple.",
      "Though, Lebanese people tend to like visuals more than anything. If you can add suitable images to your website along with call-to-action buttons, you'll convert more than any lengthy paragraph ever will. No matter how useful it is.",
      "We always preach, whatever you're writing on the web, make it 2 times less wordy.",
      "Had it not been an article, you've seen this content summarized in a paragraph or two."
    ]
  },
  {
    "type": "sectionTitle",
    "content": "People won't buy, and people will cancel"
  },
  {
    "type": "paragraphArray",
    "content": [
      "It doesn't matter how great you price your items, it matters not. People still won't buy, your items will go unsold. But don't be discouraged, it is part of the process.",
      "Uncertain buying behavior and patterns will be tough, but very valuable.",
      "Make sure to test-sell your items before going all in. Your sales are what matters, try selling your items even before they're in stock, or even before they're produced. Make sure they're sellable to some extent. This way you won't be shocked when your $50,000 inventory goes unsold.",
      "It might seem harsh, but it is crucial to accept feedback and learn from mistakes and be realistic. That's how you win.",
      "Note that people don't care if you iterate that orders are not cancellable, not everyone will follow rules and policies."
    ]
  }
]